# DGNExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNExportOptions Constructor
DGNExportOptions Class See Also
---
Constructs a new instance of DGNExportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DGNExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DGNExportOptions()
```

# See Also
DGNExportOptions Class
DGNExportOptions Overload
Autodesk.Revit.DB Namespace